app/controllers/home_controller.rb

  def index
    @tweets = Tweet.where("user_id in (?) OR user_id = ?", current_user.friend_ids, current_user).paginate(page: params[:page]).order('created_at DESC')
---
SELECT  "tweets".* FROM "tweets"  WHERE (user_id in (NULL) OR user_id = 1)  ORDER BY created_at DESC LIMIT 20 OFFSET 0